Tekla.Structures.AnalysisInternal.DotAnalysisBeamEnd.profile
The profile at the beam end.

Tekla.Structures.AnalysisInternal.DotAnalysisBeamEnd.eccentricity
The Eccentricity at the beam end.

Tekla.Structures.AnalysisInternal.DotAnalysisBeamEnd.connectivity
The connectivity at the beam end.